<?php // Вариант №10
    echo('Вариант №10' . '<br>'); 
    $a = rand(-20, 20); 
    $c = rand(-20, 20);
    $d = rand(-20, 20);
    echo ('Дано:' . '<br>' . 'a = ' . $a. '<br>' . 'c = '. $c . '<br>' . 'd = ' . $d . '<br>');
    $result = (2 * $c / $d + 2)/($d - pow($d, 2) - 1 );
    echo ('Решение:' . '<br>' . '( 2 * ' . $c . ' / ' . $d . ' + 2 ) / ( ' . $d . ' - ' . pow($d, 2) . ' - 1 ) = ' . $result . '<br>');
?>
<?php // Вариант №15
    echo ('<br>' . 'Вариант №15' . '<br>');
    $a = rand(-20, 20); 
    $c = rand(-20, 20);
    $d = rand(-20, 20);
    echo ('Дано:' . '<br>' . 'a = ' . $a. '<br>' . 'c = '. $c . '<br>' . 'd = ' . $d . '<br>');
    $result = (12 / $c + 73 - pow($d, 2))/(pow($a, 2) - 2 * $a);
    echo ('Решение:' . '<br>' . '( 12 / ' . $c . ' + 73 - ' . pow($d, 2) . ' ) / ' . (pow($a, 2) . '- 2 * ' . $a). ' = ' . $result .'<br>');
?>
